app/views/articles/show.html.erb

          <p class="text-grey text-center">
            <%= @article.published_date.present? ? "#{@article.published_date.strftime("%b %d, %Y")} • #{@article&.user&.full_name}" : '' %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]

            <% if @likes.map(&:user).include?(current_user) %>
              <%= link_to "Unlike", like_path(@likes.find_by(article: @article)), method: :delete %>
---
SELECT "likes".* FROM "likes" WHERE "likes"."article_id" = ? AND "likes"."article_id" = ? LIMIT ?  [["article_id", 1], ["article_id", 1], ["LIMIT", 1]]

          <h3>Comments</h3>
          <% @article.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 1]]